use league
go
insert team
values('马德里竞技','西蒙尼',8),
      ('皇家马德里','安切洛迪',10),
	  ('巴塞罗那','哈维',0),
      ('塞维利亚','洛佩特吉',0),
      ('贝蒂斯','佩莱格里尼',0),
      ('比利亚雷亚尔','埃梅里',0),
      ('西班牙人','莫雷诺',0),
      ('瓦伦西亚','博达拉斯',0);
go
insert player
values('格列兹曼','马德里竞技','8','左','1991-03-21',3,'普通队员',4,'健康','前场'),
      ('科克','马德里竞技','6','右','1992-01-08',1,'队长',3,'健康','中场'),
      ('希门尼斯','马德里竞技','2','右','1995-01-20',0,'普通队员',2,'健康','后场'),
      ('奥布拉克','马德里竞技','13','右','1993-01-07',0,'普通队员',4,'健康','门将'),
      ('维尼修斯','皇家马德里','20','右','2000-07-12',4,'普通队员',4,'健康','前场'),
      ('卡塞米罗','皇家马德里','14','右','1998-02-02',3,'普通队员',3,'健康','中场'),
	  ('马塞洛','皇家马德里','12','左','1988-05-12',2,'队长',4,'健康','后场'),
	  ('库尔图瓦','皇家马德里','1','左','1992-05-11',0,'普通队员',2,'健康','门将');
go
insert match
values('马德里竞技','皇家马德里','8','6','2','13',
       '20','14','12','1',1,1,0,2,1,1,2,4,2,'2021-09-08'),
	   ('皇家马德里','马德里竞技','20','14','12','1',
       '8','6','2','13',0,0,0,0,0,0,null,null,3,'2021-12-29');
go
